Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpd064.h
extern volatile __U6BRGbits_t U6BRGbits __asm__ ("U6BRG") __attribute__((section("sfrs"), address(0xBF848A40)));
extern volatile uint32_t        U6BRGCLR __attribute__((section("sfrs"),address(0xBF848A44)));
extern volatile uint32_t        U6BRGSET __attribute__((section("sfrs"),address(0xBF848A48)));
extern volatile uint32_t        U6BRGINV __attribute__((section("sfrs"),address(0xBF848A4C)));
#define DAC2CON DAC2CON
extern volatile uint32_t   DAC2CON __attribute__((section("sfrs"), address(0xBF84C400)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC2CONbits_t;
extern volatile __DAC2CONbits_t DAC2CONbits __asm__ ("DAC2CON") __attribute__((section("sfrs"), address(0xBF84C400)));
extern volatile uint32_t        DAC2CONCLR __attribute__((section("sfrs"),address(0xBF84C404)));
extern volatile uint32_t        DAC2CONSET __attribute__((section("sfrs"),address(0xBF84C408)));
extern volatile uint32_t        DAC2CONINV __attribute__((section("sfrs"),address(0xBF84C40C)));
#define DAC3CON DAC3CON
extern volatile uint32_t   DAC3CON __attribute__((section("sfrs"), address(0xBF84C600)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC3CONbits_t;
extern volatile __DAC3CONbits_t DAC3CONbits __asm__ ("DAC3CON") __attribute__((section("sfrs"), address(0xBF84C600)));
extern volatile uint32_t        DAC3CONCLR __attribute__((section("sfrs"),address(0xBF84C604)));
extern volatile uint32_t        DAC3CONSET __attribute__((section("sfrs"),address(0xBF84C608)));
extern volatile uint32_t        DAC3CONINV __attribute__((section("sfrs"),address(0xBF84C60C)));
#define ANSELA ANSELA
extern volatile uint32_t   ANSELA __attribute__((section("sfrs"), address(0xBF860000)));
typedef union {
  struct {
    uint32_t ANSA0:1;
    uint32_t ANSA1:1;
    uint32_t :2;
    uint32_t ANSA4:1;
    uint32_t :3;
    uint32_t ANSA8:1;
    uint32_t :2;
    uint32_t ANSA11:1;
    uint32_t ANSA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELAbits_t;
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs"), address(0xBF860000)));
extern volatile uint32_t        ANSELACLR __attribute__((section("sfrs"),address(0xBF860004)));
extern volatile uint32_t        ANSELASET __attribute__((section("sfrs"),address(0xBF860008)));
extern volatile uint32_t        ANSELAINV __attribute__((section("sfrs"),address(0xBF86000C)));
#define TRISA TRISA
extern volatile uint32_t   TRISA __attribute__((section("sfrs"), address(0xBF860010)));
typedef union {
  struct {
    uint32_t TRISA0:1;
    uint32_t TRISA1:1;
    uint32_t :2;
    uint32_t TRISA4:1;
    uint32_t :2;
    uint32_t TRISA7:1;
    uint32_t TRISA8:1;
    uint32_t :1;
    uint32_t TRISA10:1;
    uint32_t TRISA11:1;
    uint32_t TRISA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs"), address(0xBF860010)));
extern volatile uint32_t        TRISACLR __attribute__((section("sfrs"),address(0xBF860014)));
extern volatile uint32_t        TRISASET __attribute__((section("sfrs"),address(0xBF860018)));
extern volatile uint32_t        TRISAINV __attribute__((section("sfrs"),address(0xBF86001C)));
#define PORTA PORTA
extern volatile uint32_t   PORTA __attribute__((section("sfrs"), address(0xBF860020)));
typedef union {
  struct {
    uint32_t RA0:1;
    uint32_t RA1:1;
    uint32_t :2;
    uint32_t RA4:1;
    uint32_t :2;
    uint32_t RA7:1;
    uint32_t RA8:1;
    uint32_t :1;
    uint32_t RA10:1;
    uint32_t RA11:1;
    uint32_t RA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs"), address(0xBF860020)));
extern volatile uint32_t        PORTACLR __attribute__((section("sfrs"),address(0xBF860024)));
extern volatile uint32_t        PORTASET __attribute__((section("sfrs"),address(0xBF860028)));
extern volatile uint32_t        PORTAINV __attribute__((section("sfrs"),address(0xBF86002C)));
#define LATA LATA
extern volatile uint32_t   LATA __attribute__((section("sfrs"), address(0xBF860030)));
typedef union {
  struct {
    uint32_t LATA0:1;
    uint32_t LATA1:1;
    uint32_t :2;
    uint32_t LATA4:1;
    uint32_t :2;
    uint32_t LATA7:1;
    uint32_t LATA8:1;
    uint32_t :1;
    uint32_t LATA10:1;
    uint32_t LATA11:1;
    uint32_t LATA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs"), address(0xBF860030)));
extern volatile uint32_t        LATACLR __attribute__((section("sfrs"),address(0xBF860034)));
extern volatile uint32_t        LATASET __attribute__((section("sfrs"),address(0xBF860038)));
extern volatile uint32_t        LATAINV __attribute__((section("sfrs"),address(0xBF86003C)));
#define ODCA ODCA
extern volatile uint32_t   ODCA __attribute__((section("sfrs"), address(0xBF860040)));
typedef union {
  struct {
    uint32_t ODCA0:1;
    uint32_t ODCA1:1;
    uint32_t :2;
    uint32_t ODCA4:1;
    uint32_t :2;
    uint32_t ODCA7:1;
    uint32_t ODCA8:1;
    uint32_t :1;
    uint32_t ODCA10:1;
    uint32_t ODCA11:1;
    uint32_t ODCA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs"), address(0xBF860040)));
extern volatile uint32_t        ODCACLR __attribute__((section("sfrs"),address(0xBF860044)));
extern volatile uint32_t        ODCASET __attribute__((section("sfrs"),address(0xBF860048)));
extern volatile uint32_t        ODCAINV __attribute__((section("sfrs"),address(0xBF86004C)));
#define CNPUA CNPUA
extern volatile uint32_t   CNPUA __attribute__((section("sfrs"), address(0xBF860050)));
typedef union {
  struct {
    uint32_t CNPUA0:1;
    uint32_t CNPUA1:1;
    uint32_t :2;
    uint32_t CNPUA4:1;
    uint32_t :2;
    uint32_t CNPUA7:1;
    uint32_t CNPUA8:1;
    uint32_t :1;
    uint32_t CNPUA10:1;
    uint32_t CNPUA11:1;
    uint32_t CNPUA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUAbits_t;
extern volatile __CNPUAbits_t CNPUAbits __asm__ ("CNPUA") __attribute__((section("sfrs"), address(0xBF860050)));
extern volatile uint32_t        CNPUACLR __attribute__((section("sfrs"),address(0xBF860054)));
extern volatile uint32_t        CNPUASET __attribute__((section("sfrs"),address(0xBF860058)));
extern volatile uint32_t        CNPUAINV __attribute__((section("sfrs"),address(0xBF86005C)));
#define CNPDA CNPDA
extern volatile uint32_t   CNPDA __attribute__((section("sfrs"), address(0xBF860060)));
typedef union {
  struct {
    uint32_t CNPDA0:1;
    uint32_t CNPDA1:1;
    uint32_t :2;
    uint32_t CNPDA4:1;
    uint32_t :2;
    uint32_t CNPDA7:1;
    uint32_t CNPDA8:1;
    uint32_t :1;
    uint32_t CNPDA10:1;
    uint32_t CNPDA11:1;
    uint32_t CNPDA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDAbits_t;
extern volatile __CNPDAbits_t CNPDAbits __asm__ ("CNPDA") __attribute__((section("sfrs"), address(0xBF860060)));
extern volatile uint32_t        CNPDACLR __attribute__((section("sfrs"),address(0xBF860064)));
extern volatile uint32_t        CNPDASET __attribute__((section("sfrs"),address(0xBF860068)));
extern volatile uint32_t        CNPDAINV __attribute__((section("sfrs"),address(0xBF86006C)));
#define CNCONA CNCONA
extern volatile uint32_t   CNCONA __attribute__((section("sfrs"), address(0xBF860070)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONAbits_t;
extern volatile __CNCONAbits_t CNCONAbits __asm__ ("CNCONA") __attribute__((section("sfrs"), address(0xBF860070)));
extern volatile uint32_t        CNCONACLR __attribute__((section("sfrs"),address(0xBF860074)));
extern volatile uint32_t        CNCONASET __attribute__((section("sfrs"),address(0xBF860078)));
extern volatile uint32_t        CNCONAINV __attribute__((section("sfrs"),address(0xBF86007C)));
#define CNENA CNENA
extern volatile uint32_t   CNENA __attribute__((section("sfrs"), address(0xBF860080)));
typedef union {
  struct {
    uint32_t CNIEA0:1;
    uint32_t CNIEA1:1;
    uint32_t :2;
    uint32_t CNIEA4:1;
    uint32_t :2;
    uint32_t CNIEA7:1;
    uint32_t CNIEA8:1;
    uint32_t :1;
    uint32_t CNIEA10:1;
    uint32_t CNIEA11:1;
    uint32_t CNIEA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENAbits_t;
extern volatile __CNENAbits_t CNENAbits __asm__ ("CNENA") __attribute__((section("sfrs"), address(0xBF860080)));
extern volatile uint32_t        CNENACLR __attribute__((section("sfrs"),address(0xBF860084)));
extern volatile uint32_t        CNENASET __attribute__((section("sfrs"),address(0xBF860088)));
extern volatile uint32_t        CNENAINV __attribute__((section("sfrs"),address(0xBF86008C)));
#define CNSTATA CNSTATA
extern volatile uint32_t   CNSTATA __attribute__((section("sfrs"), address(0xBF860090)));
typedef union {
  struct {
    uint32_t CNSTATA0:1;
    uint32_t CNSTATA1:1;
    uint32_t :2;
    uint32_t CNSTATA4:1;
    uint32_t :2;
    uint32_t CNSTATA7:1;
    uint32_t CNSTATA8:1;
    uint32_t :1;
    uint32_t CNSTATA10:1;
    uint32_t CNSTATA11:1;
    uint32_t CNSTATA12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATAbits_t;
extern volatile __CNSTATAbits_t CNSTATAbits __asm__ ("CNSTATA") __attribute__((section("sfrs"), address(0xBF860090)));
extern volatile uint32_t        CNSTATACLR __attribute__((section("sfrs"),address(0xBF860094)));
extern volatile uint32_t        CNSTATASET __attribute__((section("sfrs"),address(0xBF860098)));
extern volatile uint32_t        CNSTATAINV __attribute__((section("sfrs"),address(0xBF86009C)));
#define CNNEA CNNEA
extern volatile uint32_t   CNNEA __attribute__((section("sfrs"), address(0xBF8600A0)));
typedef struct {
  uint32_t CNNEA0:1;
  uint32_t CNNEA1:1;
  uint32_t :2;
  uint32_t CNNEA4:1;
  uint32_t :2;
  uint32_t CNNEA7:1;
  uint32_t CNNEA8:1;
  uint32_t :1;
  uint32_t CNNEA10:1;
  uint32_t CNNEA11:1;
  uint32_t CNNEA12:1;
} __CNNEAbits_t;
extern volatile __CNNEAbits_t CNNEAbits __asm__ ("CNNEA") __attribute__((section("sfrs"), address(0xBF8600A0)));
extern volatile uint32_t        CNNEACLR __attribute__((section("sfrs"),address(0xBF8600A4)));
extern volatile uint32_t        CNNEASET __attribute__((section("sfrs"),address(0xBF8600A8)));
extern volatile uint32_t        CNNEAINV __attribute__((section("sfrs"),address(0xBF8600AC)));
#define CNFA CNFA
extern volatile uint32_t   CNFA __attribute__((section("sfrs"), address(0xBF8600B0)));
typedef struct {
  uint32_t CNFA0:1;
  uint32_t CNFA1:1;
  uint32_t :2;
  uint32_t CNFA4:1;
  uint32_t :2;
  uint32_t CNFA7:1;
  uint32_t CNFA8:1;
  uint32_t :1;
  uint32_t CNFA10:1;
  uint32_t CNFA11:1;
  uint32_t CNFA12:1;
} __CNFAbits_t;
