Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpd064.h
#define _CFGCON_PGLOCK_POSITION                  0x0000000B
#define _CFGCON_PGLOCK_MASK                      0x00000800
#define _CFGCON_PGLOCK_LENGTH                    0x00000001

#define _CFGCON_PMDLOCK_POSITION                 0x0000000C
#define _CFGCON_PMDLOCK_MASK                     0x00001000
#define _CFGCON_PMDLOCK_LENGTH                   0x00000001

#define _CFGCON_IOLOCK_POSITION                  0x0000000D
#define _CFGCON_IOLOCK_MASK                      0x00002000
#define _CFGCON_IOLOCK_LENGTH                    0x00000001

#define _CFGCON_OCACLK_POSITION                  0x00000010
#define _CFGCON_OCACLK_MASK                      0x00010000
#define _CFGCON_OCACLK_LENGTH                    0x00000001

#define _CFGCON_ICACLK_POSITION                  0x00000011
#define _CFGCON_ICACLK_MASK                      0x00020000
#define _CFGCON_ICACLK_LENGTH                    0x00000001

#define _CFGCON_ADCPRI_POSITION                  0x0000001A
#define _CFGCON_ADCPRI_MASK                      0x04000000
#define _CFGCON_ADCPRI_LENGTH                    0x00000001

#define _DEVID_DEVID_POSITION                    0x00000000
#define _DEVID_DEVID_MASK                        0x0FFFFFFF
#define _DEVID_DEVID_LENGTH                      0x0000001C

#define _DEVID_VER_POSITION                      0x0000001C
#define _DEVID_VER_MASK                          0xF0000000
#define _DEVID_VER_LENGTH                        0x00000004

#define _SYSKEY_SYSKEY_POSITION                  0x00000000
#define _SYSKEY_SYSKEY_MASK                      0xFFFFFFFF
#define _SYSKEY_SYSKEY_LENGTH                    0x00000020

#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

#define _PMD1_DAC1MD_POSITION                    0x00000004
#define _PMD1_DAC1MD_MASK                        0x00000010
#define _PMD1_DAC1MD_LENGTH                      0x00000001

#define _PMD1_DAC2MD_POSITION                    0x00000005
#define _PMD1_DAC2MD_MASK                        0x00000020
#define _PMD1_DAC2MD_LENGTH                      0x00000001

#define _PMD1_DAC3MD_POSITION                    0x00000006
#define _PMD1_DAC3MD_MASK                        0x00000040
#define _PMD1_DAC3MD_LENGTH                      0x00000001

#define _PMD1_CTMUMD_POSITION                    0x00000008
#define _PMD1_CTMUMD_MASK                        0x00000100
#define _PMD1_CTMUMD_LENGTH                      0x00000001

#define _PMD1_EEMD_POSITION                      0x00000009
#define _PMD1_EEMD_MASK                          0x00000200
#define _PMD1_EEMD_LENGTH                        0x00000001

#define _PMD1_HLVDMD_POSITION                    0x00000014
#define _PMD1_HLVDMD_MASK                        0x00100000
#define _PMD1_HLVDMD_LENGTH                      0x00000001

#define _PMD2_CMP1MD_POSITION                    0x00000000
#define _PMD2_CMP1MD_MASK                        0x00000001
#define _PMD2_CMP1MD_LENGTH                      0x00000001

#define _PMD2_CMP2MD_POSITION                    0x00000001
#define _PMD2_CMP2MD_MASK                        0x00000002
#define _PMD2_CMP2MD_LENGTH                      0x00000001

#define _PMD2_CMP3MD_POSITION                    0x00000002
#define _PMD2_CMP3MD_MASK                        0x00000004
#define _PMD2_CMP3MD_LENGTH                      0x00000001

#define _PMD2_CMP4MD_POSITION                    0x00000003
#define _PMD2_CMP4MD_MASK                        0x00000008
#define _PMD2_CMP4MD_LENGTH                      0x00000001

#define _PMD2_CMP5MD_POSITION                    0x00000004
#define _PMD2_CMP5MD_MASK                        0x00000010
#define _PMD2_CMP5MD_LENGTH                      0x00000001

#define _PMD2_OPA1MD_POSITION                    0x00000010
#define _PMD2_OPA1MD_MASK                        0x00010000
#define _PMD2_OPA1MD_LENGTH                      0x00000001

#define _PMD2_OPA2MD_POSITION                    0x00000011
#define _PMD2_OPA2MD_MASK                        0x00020000
#define _PMD2_OPA2MD_LENGTH                      0x00000001

#define _PMD2_OPA3MD_POSITION                    0x00000012
#define _PMD2_OPA3MD_MASK                        0x00040000
#define _PMD2_OPA3MD_LENGTH                      0x00000001

#define _PMD2_OPA5MD_POSITION                    0x00000014
#define _PMD2_OPA5MD_MASK                        0x00100000
#define _PMD2_OPA5MD_LENGTH                      0x00000001

#define _PMD3_IC1MD_POSITION                     0x00000000
#define _PMD3_IC1MD_MASK                         0x00000001
#define _PMD3_IC1MD_LENGTH                       0x00000001

#define _PMD3_IC2MD_POSITION                     0x00000001
#define _PMD3_IC2MD_MASK                         0x00000002
#define _PMD3_IC2MD_LENGTH                       0x00000001

#define _PMD3_IC3MD_POSITION                     0x00000002
#define _PMD3_IC3MD_MASK                         0x00000004
#define _PMD3_IC3MD_LENGTH                       0x00000001

#define _PMD3_IC4MD_POSITION                     0x00000003
#define _PMD3_IC4MD_MASK                         0x00000008
#define _PMD3_IC4MD_LENGTH                       0x00000001

#define _PMD3_IC5MD_POSITION                     0x00000004
#define _PMD3_IC5MD_MASK                         0x00000010
#define _PMD3_IC5MD_LENGTH                       0x00000001

#define _PMD3_IC6MD_POSITION                     0x00000005
#define _PMD3_IC6MD_MASK                         0x00000020
#define _PMD3_IC6MD_LENGTH                       0x00000001

#define _PMD3_IC7MD_POSITION                     0x00000006
#define _PMD3_IC7MD_MASK                         0x00000040
#define _PMD3_IC7MD_LENGTH                       0x00000001

#define _PMD3_IC8MD_POSITION                     0x00000007
#define _PMD3_IC8MD_MASK                         0x00000080
#define _PMD3_IC8MD_LENGTH                       0x00000001

#define _PMD3_IC9MD_POSITION                     0x00000008
#define _PMD3_IC9MD_MASK                         0x00000100
#define _PMD3_IC9MD_LENGTH                       0x00000001

#define _PMD3_IC10MD_POSITION                    0x00000009
#define _PMD3_IC10MD_MASK                        0x00000200
#define _PMD3_IC10MD_LENGTH                      0x00000001

#define _PMD3_IC11MD_POSITION                    0x0000000A
#define _PMD3_IC11MD_MASK                        0x00000400
#define _PMD3_IC11MD_LENGTH                      0x00000001

#define _PMD3_IC12MD_POSITION                    0x0000000B
#define _PMD3_IC12MD_MASK                        0x00000800
#define _PMD3_IC12MD_LENGTH                      0x00000001

#define _PMD3_IC13MD_POSITION                    0x0000000C
#define _PMD3_IC13MD_MASK                        0x00001000
#define _PMD3_IC13MD_LENGTH                      0x00000001

#define _PMD3_IC14MD_POSITION                    0x0000000D
#define _PMD3_IC14MD_MASK                        0x00002000
#define _PMD3_IC14MD_LENGTH                      0x00000001

#define _PMD3_IC15MD_POSITION                    0x0000000E
#define _PMD3_IC15MD_MASK                        0x00004000
#define _PMD3_IC15MD_LENGTH                      0x00000001

