Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpd064.h
#define _CNCONG_w_POSITION                       0x00000000
#define _CNCONG_w_MASK                           0xFFFFFFFF
#define _CNCONG_w_LENGTH                         0x00000020

#define _CNENG_CNIEG6_POSITION                   0x00000006
#define _CNENG_CNIEG6_MASK                       0x00000040
#define _CNENG_CNIEG6_LENGTH                     0x00000001

#define _CNENG_CNIEG7_POSITION                   0x00000007
#define _CNENG_CNIEG7_MASK                       0x00000080
#define _CNENG_CNIEG7_LENGTH                     0x00000001

#define _CNENG_CNIEG8_POSITION                   0x00000008
#define _CNENG_CNIEG8_MASK                       0x00000100
#define _CNENG_CNIEG8_LENGTH                     0x00000001

#define _CNENG_CNIEG9_POSITION                   0x00000009
#define _CNENG_CNIEG9_MASK                       0x00000200
#define _CNENG_CNIEG9_LENGTH                     0x00000001

#define _CNENG_w_POSITION                        0x00000000
#define _CNENG_w_MASK                            0xFFFFFFFF
#define _CNENG_w_LENGTH                          0x00000020

#define _CNSTATG_CNSTATG6_POSITION               0x00000006
#define _CNSTATG_CNSTATG6_MASK                   0x00000040
#define _CNSTATG_CNSTATG6_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG7_POSITION               0x00000007
#define _CNSTATG_CNSTATG7_MASK                   0x00000080
#define _CNSTATG_CNSTATG7_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG8_POSITION               0x00000008
#define _CNSTATG_CNSTATG8_MASK                   0x00000100
#define _CNSTATG_CNSTATG8_LENGTH                 0x00000001

#define _CNSTATG_CNSTATG9_POSITION               0x00000009
#define _CNSTATG_CNSTATG9_MASK                   0x00000200
#define _CNSTATG_CNSTATG9_LENGTH                 0x00000001

#define _CNSTATG_w_POSITION                      0x00000000
#define _CNSTATG_w_MASK                          0xFFFFFFFF
#define _CNSTATG_w_LENGTH                        0x00000020

#define _CNNEG_CNNEG6_POSITION                   0x00000006
#define _CNNEG_CNNEG6_MASK                       0x00000040
#define _CNNEG_CNNEG6_LENGTH                     0x00000001

#define _CNNEG_CNNEG7_POSITION                   0x00000007
#define _CNNEG_CNNEG7_MASK                       0x00000080
#define _CNNEG_CNNEG7_LENGTH                     0x00000001

#define _CNNEG_CNNEG8_POSITION                   0x00000008
#define _CNNEG_CNNEG8_MASK                       0x00000100
#define _CNNEG_CNNEG8_LENGTH                     0x00000001

#define _CNNEG_CNNEG9_POSITION                   0x00000009
#define _CNNEG_CNNEG9_MASK                       0x00000200
#define _CNNEG_CNNEG9_LENGTH                     0x00000001

#define _CNFG_CNFG6_POSITION                     0x00000006
#define _CNFG_CNFG6_MASK                         0x00000040
#define _CNFG_CNFG6_LENGTH                       0x00000001

#define _CNFG_CNFG7_POSITION                     0x00000007
#define _CNFG_CNFG7_MASK                         0x00000080
#define _CNFG_CNFG7_LENGTH                       0x00000001

#define _CNFG_CNFG8_POSITION                     0x00000008
#define _CNFG_CNFG8_MASK                         0x00000100
#define _CNFG_CNFG8_LENGTH                       0x00000001

#define _CNFG_CNFG9_POSITION                     0x00000009
#define _CNFG_CNFG9_MASK                         0x00000200
#define _CNFG_CNFG9_LENGTH                       0x00000001

#define _ADCCON1_DMABL_POSITION                  0x00000000
#define _ADCCON1_DMABL_MASK                      0x00000007
#define _ADCCON1_DMABL_LENGTH                    0x00000003

#define _ADCCON1_STRGLVL_POSITION                0x00000003
#define _ADCCON1_STRGLVL_MASK                    0x00000008
#define _ADCCON1_STRGLVL_LENGTH                  0x00000001

#define _ADCCON1_IRQVS_POSITION                  0x00000004
#define _ADCCON1_IRQVS_MASK                      0x00000070
#define _ADCCON1_IRQVS_LENGTH                    0x00000003

#define _ADCCON1_FSPBCLKEN_POSITION              0x00000009
#define _ADCCON1_FSPBCLKEN_MASK                  0x00000200
#define _ADCCON1_FSPBCLKEN_LENGTH                0x00000001

#define _ADCCON1_FSSCLKEN_POSITION               0x0000000A
#define _ADCCON1_FSSCLKEN_MASK                   0x00000400
#define _ADCCON1_FSSCLKEN_LENGTH                 0x00000001

#define _ADCCON1_CVDEN_POSITION                  0x0000000B
#define _ADCCON1_CVDEN_MASK                      0x00000800
#define _ADCCON1_CVDEN_LENGTH                    0x00000001

#define _ADCCON1_AICPMPEN_POSITION               0x0000000C
#define _ADCCON1_AICPMPEN_MASK                   0x00001000
#define _ADCCON1_AICPMPEN_LENGTH                 0x00000001

#define _ADCCON1_SIDL_POSITION                   0x0000000D
#define _ADCCON1_SIDL_MASK                       0x00002000
#define _ADCCON1_SIDL_LENGTH                     0x00000001

#define _ADCCON1_ON_POSITION                     0x0000000F
#define _ADCCON1_ON_MASK                         0x00008000
#define _ADCCON1_ON_LENGTH                       0x00000001

#define _ADCCON1_STRGSRC_POSITION                0x00000010
#define _ADCCON1_STRGSRC_MASK                    0x001F0000
#define _ADCCON1_STRGSRC_LENGTH                  0x00000005

#define _ADCCON1_SELRES_POSITION                 0x00000015
#define _ADCCON1_SELRES_MASK                     0x00600000
#define _ADCCON1_SELRES_LENGTH                   0x00000002

#define _ADCCON1_FRACT_POSITION                  0x00000017
#define _ADCCON1_FRACT_MASK                      0x00800000
#define _ADCCON1_FRACT_LENGTH                    0x00000001

#define _ADCCON1_TRBSLV_POSITION                 0x00000018
#define _ADCCON1_TRBSLV_MASK                     0x07000000
#define _ADCCON1_TRBSLV_LENGTH                   0x00000003

#define _ADCCON1_TRBMST_POSITION                 0x0000001B
#define _ADCCON1_TRBMST_MASK                     0x38000000
#define _ADCCON1_TRBMST_LENGTH                   0x00000003

#define _ADCCON1_TRBERR_POSITION                 0x0000001E
#define _ADCCON1_TRBERR_MASK                     0x40000000
#define _ADCCON1_TRBERR_LENGTH                   0x00000001

#define _ADCCON1_TRBEN_POSITION                  0x0000001F
#define _ADCCON1_TRBEN_MASK                      0x80000000
#define _ADCCON1_TRBEN_LENGTH                    0x00000001

#define _ADCCON2_ADCDIV_POSITION                 0x00000000
#define _ADCCON2_ADCDIV_MASK                     0x0000007F
#define _ADCCON2_ADCDIV_LENGTH                   0x00000007

#define _ADCCON2_ADCEIS_POSITION                 0x00000008
#define _ADCCON2_ADCEIS_MASK                     0x00000700
#define _ADCCON2_ADCEIS_LENGTH                   0x00000003

#define _ADCCON2_ADCEIOVR_POSITION               0x0000000C
#define _ADCCON2_ADCEIOVR_MASK                   0x00001000
#define _ADCCON2_ADCEIOVR_LENGTH                 0x00000001

#define _ADCCON2_EOSIEN_POSITION                 0x0000000D
#define _ADCCON2_EOSIEN_MASK                     0x00002000
#define _ADCCON2_EOSIEN_LENGTH                   0x00000001

#define _ADCCON2_REFFLTIEN_POSITION              0x0000000E
#define _ADCCON2_REFFLTIEN_MASK                  0x00004000
#define _ADCCON2_REFFLTIEN_LENGTH                0x00000001

